In [15]:
# dependencies
import os
import csv
import pandas as pd

In [16]:
annual_file = os.path.join("raw/annual_costs.csv")
print(annual_file)

raw/annual_costs.csv

In [17]:
# Use Pandas to read data
annual_costs_df = pd.read_csv(annual_file)

# remove any spaces in the cell
annual_costs_df.columns = annual_costs_df.columns.to_series().apply(lambda x: x.strip())
annual_costs_df

,Costs,Notes,Sm Dog,Med Dog,Lg Dog,Cat,Rabbit,G. Pig,Ferret,Sm Bird,Fish
0,Food,1.0,$212,$319,$400.31,$224,$144.80,$45,$323.80,$192,$12
1,Recurring medical,2.0,$210,$235,$260,$160,$70,$70,$85,NaN,NaN
2,Litter,3.0,$165,$208,$144,$210,NaN,NaN,NaN,NaN,NaN
3,Toys/Treats,NaN,$40,$55,$75,$25,$40,$30,$25,$25,NaN
4,License,NaN,$15,$15,$15,NaN,NaN,NaN,NaN,NaN,NaN
5,Health Insurance,4.0,$225,$225,$225,$175,NaN,NaN,NaN,NaN,NaN
6,Misc.,NaN,$35,$45,$65,$30,$15,$15,$15,$15,$15
7,Long Hair Groom,NaN,$264,$320,$408,NaN,NaN,NaN,NaN,NaN,NaN
8,Annual Total,NaN,$737,$894,"$1,040.31",$809,$477.80,$304,$573.80,$317,$27

In [4]:
# listing all columns in the dataframe
list(annual_costs_df.columns.values)

['Costs',
 'Notes',
 'Sm\nDog',
 'Med\nDog',
 'Lg Dog',
 'Cat',
 'Rabbit',
 'G. Pig',
 'Ferret',
 'Sm\nBird',
 'Fish']

In [5]:
# remove new line
annual_costs_df = annual_costs_df.replace('\n','', regex=True)

# drop columns not related to dog
new_annual_costs_df = annual_costs_df.drop(columns=['Notes', 'Rabbit', 'G. Pig', 'Ferret', 'Sm\nBird', 'Fish'])
list(new_annual_costs_df.columns.values)

['Costs', 'Sm\nDog', 'Med\nDog', 'Lg Dog', 'Cat']

In [6]:
# rename columns
new_annual_costs_df1 = new_annual_costs_df.rename(index=str, columns={"Costs": "Items", "Sm\nDog": "Sm_Dog", "Med\nDog": "Med_Dog", "Lg Dog": "Lg_Dog", "Cat": "Cat"})

In [7]:
new_annual_costs_df1

               Items Sm_Dog Med_Dog      Lg_Dog    Cat
0               Food  $212    $319     $400.31   $224
1  Recurring medical  $210    $235        $260   $160
2             Litter  $165    $208        $144   $210
3        Toys/Treats   $40     $55         $75    $25
4            License   $15     $15         $15     NaN
5   Health Insurance  $225    $225        $225   $175
6              Misc.   $35     $45         $65    $30
7    Long Hair Groom  $264    $320        $408     NaN
8       Annual Total  $737    $894   $1,040.31   $809

In [8]:
new_annual_costs_df1.dtypes

Items      object
Sm_Dog     object
Med_Dog    object
Lg_Dog     object
Cat        object
dtype: object

In [9]:
cols = ['Sm_Dog', 'Med_Dog', 'Lg_Dog', 'Cat']

# remove $ sign from cell values
new_annual_costs_df1[cols] = new_annual_costs_df1[cols].replace({'\$': '', ',': ''}, regex=True)

# assign numeric cell values to type float
new_annual_costs_df1[cols] = new_annual_costs_df1[cols].astype(float)

new_annual_costs_df1.dtypes

Items       object
Sm_Dog     float64
Med_Dog    float64
Lg_Dog     float64
Cat        float64
dtype: object

In [10]:
new_annual_costs_df1

               Items  Sm_Dog  Med_Dog   Lg_Dog    Cat
0               Food   212.0    319.0   400.31  224.0
1  Recurring medical   210.0    235.0   260.00  160.0
2             Litter   165.0    208.0   144.00  210.0
3        Toys/Treats    40.0     55.0    75.00   25.0
4            License    15.0     15.0    15.00    NaN
5   Health Insurance   225.0    225.0   225.00  175.0
6              Misc.    35.0     45.0    65.00   30.0
7    Long Hair Groom   264.0    320.0   408.00    NaN
8       Annual Total   737.0    894.0  1040.31  809.0

In [12]:
# export datafame to new_annual_costs.csv in the output folder
export_new_annual_costs_csv = new_annual_costs_df1.to_csv ("data/new_annual_costs.csv", index = None, header=True)

In [13]:
# Module used to connect Python with MongoDb
import pymongo
import json

# The default port used by MongoDB is 27017
# https://docs.mongodb.com/manual/reference/default-mongodb-port/
mongo_client = pymongo.MongoClient("mongodb://localhost:27017")
#mongo_client = pymongo.MongoClient("mongodb+srv://k9sam:1234@petfinder-qbryn.mongodb.net/test?retryWrites=true")


# print success when establish connection
print("success")

success

In [14]:
# Define database in mongoDB
mongo_pet_db = mongo_client['pets']

# mongoDB collection name = annual_costs
mongo_annual_costs = mongo_pet_db["annual_costs"]

# insert dataframe row to the collection 
records = json.loads(new_annual_costs_df1.T.to_json()).values()
mongo_annual_costs.insert(records)

C:\Users\bbmerci\AppData\Local\conda\conda\envs\PythonData\lib\site-packages\ipykernel_launcher.py:9: DeprecationWarning: insert is deprecated. Use insert_one or insert_many instead.
  if __name__ == '__main__':

[ObjectId('5ca97a687cb0173600ccb08f'),
 ObjectId('5ca97a687cb0173600ccb090'),
 ObjectId('5ca97a687cb0173600ccb091'),
 ObjectId('5ca97a687cb0173600ccb092'),
 ObjectId('5ca97a687cb0173600ccb093'),
 ObjectId('5ca97a687cb0173600ccb094'),
 ObjectId('5ca97a687cb0173600ccb095'),
 ObjectId('5ca97a687cb0173600ccb096'),
 ObjectId('5ca97a687cb0173600ccb097')]